{"class_name": "Sequential", "config": {"name": "sequential_147", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "cnn_block_100_input"}}, {"class_name": "CNNBlock", "config": {"number_of_filters": 32, "filter_size": [3, 3], "activation_function": "relu", "dropout": 0.2, "pool_size": [2, 2]}}, {"class_name": "CNNBlock", "config": {"number_of_filters": 32, "filter_size": [3, 3], "activation_function": "relu", "dropout": 0.2, "pool_size": [2, 2]}}, {"class_name": "CNNBlock", "config": {"number_of_filters": 32, "filter_size": [3, 3], "activation_function": "relu", "dropout": 0.2, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_45", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_135", "trainable": true, "dtype": "float32", "units": 256, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_136", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_137", "trainable": true, "dtype": "float32", "units": 26, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Softmax", "config": {"name": "softmax_45", "trainable": true, "dtype": "float32", "axis": -1}}]}, "keras_version": "2.7.0", "backend": "tensorflow"}